src/test/resources/listMethods.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
  xmlns:id="http://x-road.eu/xsd/identifiers">
  <SOAP-ENV:Header>
    <xroad:client id:objectType="MEMBER">
      <id:xRoadInstance>Inst1</id:xRoadInstance>
      <id:memberClass>MemberClass1</id:memberClass>
      <id:memberCode>ClientId</id:memberCode>
    </xroad:client>
    <xroad:service id:objectType="SERVICE">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>ProviderId</id:memberCode>
      <id:serviceCode>listMethods</id:serviceCode>
    </xroad:service>
    <xroad:id>411d6755661409fed365ad8135f8210be07613da</xroad:id>
    <xroad:protocolVersion>4.0</xroad:protocolVersion>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <xroad:listMethods />
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>